#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.demo.aws_wafv2_ip_set.ipset1 will be created
  + resource "aws_wafv2_ip_set" "ipset1" {
      + addresses          = [
          + "1.2.3.4/32",
          + "5.6.7.8/32",
        ]
      + arn                = (known after apply)
      + description        = "Example IP set"
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "cq-ipset"
      + scope              = "REGIONAL"
      + tags               = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
      + tags_all           = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
    }

  # module.demo.aws_wafv2_ip_set.ipset2 will be created
  + resource "aws_wafv2_ip_set" "ipset2" {
      + addresses          = [
          + "1.2.3.4/32",
          + "5.6.7.8/32",
        ]
      + arn                = (known after apply)
      + description        = "Example IP set"
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "cq-ipset"
      + scope              = "CLOUDFRONT"
      + tags               = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
      + tags_all           = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
    }

  # module.demo.aws_wafv2_regex_pattern_set.regex1 will be created
  + resource "aws_wafv2_regex_pattern_set" "regex1" {
      + arn         = (known after apply)
      + description = "Example regex pattern set 1"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "cq-regex-set1"
      + scope       = "REGIONAL"
      + tags        = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
      + tags_all    = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }

      + regular_expression {
          + regex_string = "one"
        }
      + regular_expression {
          + regex_string = "two"
        }
    }

  # module.demo.aws_wafv2_regex_pattern_set.regex2 will be created
  + resource "aws_wafv2_regex_pattern_set" "regex2" {
      + arn         = (known after apply)
      + description = "Example regex pattern set 2"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "cq-regex-set2"
      + scope       = "CLOUDFRONT"
      + tags        = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
      + tags_all    = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }

      + regular_expression {
          + regex_string = "one"
        }
      + regular_expression {
          + regex_string = "two"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @irmatov, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*